OF_cases/flatPlate/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

xMin  -0.5;
xMax   2.5;
yMin   0.0;
yMax   0.2;
zMin  -0.1;
zMax   0.1;

// --- Broj celija ---/
x1Cells 25;
x2Cells 100;
yCells  120;

//--- Grading -----//
yGrad 150;
x1Grad 0.2;
x2Grad 8;

convertToMeters 1;

vertices
(
 ($xMin $yMin $zMin)   
 (0 0 $zMin)
 ($xMax $yMin $zMin)
 ($xMax $yMax $zMin)
 (0 $yMax $zMin)
 ($xMin $yMax $zMin)
 
 ($xMin $yMin $zMax)   
 (0 0 $zMax)
 ($xMax $yMin $zMax)
 ($xMax $yMax $zMax)
 (0 $yMax $zMax)
 ($xMin $yMax $zMax)
);

blocks
(
    hex (0 1 4 5 6 7 10 11) ($x1Cells $yCells 1) simpleGrading ($x1Grad $yGrad 1)
    hex (1 2 3 4 7 8 9 10)  ($x2Cells $yCells 1) simpleGrading ($x2Grad $yGrad 1)  
);

edges
(
);

boundary
(
    INLET
    {
        type patch;
        faces
        (
            (6 11 5 0)
        );
    }

    OUTLET
    {
      type patch;
      faces
      (
         (2 3 9 8)
      );
    }


    TOP
    {
        type patch;
        faces
        (
            (4 5 11 10)
            (3 4 10 9)
        );
    }

    PLOCHA
    {
        type wall;
        faces
        (
            (7 1 2 8)
        );
    }

    LEADING_EDGE
    {
       type symmetryPlane;
       faces
       (
           (6 0 1 7)
       );
    }

    NAPRED_NAZAD
    {
      type empty;
      faces
      (
         (0 5 4 1)
         (1 4 3 2)
         (6 7 10 11)
         (7 8 9 10)
      );
    }    
);

mergePatchPairs
(
);

// ************************************************************************* //
