OF_cases/flatPlate/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    INLET          
      {
        type            fixedValue;
        value           uniform (1 0 0);
      }

     OUTLET      
      {
        type            zeroGradient;
      }
    
     TOP
      {
	type            zeroGradient;
      }

    PLOCHA      
      {
        type            fixedValue;
        value           uniform (0 0 0);
      }
    LEADING_EDGE
      {
	type            symmetryPlane;
      } 
    NAPRED_NAZAD    
    {
        type            empty;
    }
}

// ************************************************************************* //
