OF_cases/flatPlate/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
     INLET          
     {
	 type            zeroGradient;       
     }
     
     OUTLET        
     {
	 type            fixedValue;
	 value           uniform 0;
     }
     
     TOP
     {
	 type            fixedValue;
	 value           uniform 0;
     }
     
     PLOCHA    
     {
	 type            zeroGradient;
     }
   
     LEADING_EDGE
     {
	 type            symmetryPlane;
     }
     
     NAPRED_NAZAD  
     {
	 type            empty;
     }
}

// ************************************************************************* //
