OF_cases/flatPlate/system/profili_brzine
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start and
    end points. A specified number of graph points are used, distributed
    uniformly along the line.

\*---------------------------------------------------------------------------*/

type sets;

libs            ("libsampling.so");

writeControl    writeTime;

interpolationScheme cellPoint;

setFormat       raw;

yMax  0.2;

sets
(
    x_1
    {
        type            lineUniform;
        axis            y;
        start           (0.5 0 0);
        end             (0.5 $yMax 0);
        nPoints         200;
    }
    
    x_2
    {
        type            lineUniform;
        axis            y;
        start           (1.0 0 0);
        end             (1.0 $yMax 0);
        nPoints         200;
    }
    x_3
    {
        type            lineUniform;
        axis            y;
        start           (1.5 0 0);
        end             (1.5 $yMax 0);
        nPoints         200;
    }
    
);

fields          (U);

// ************************************************************************* //
